
&НаСервере
Процедура СЗПР_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьЭлементыНаФорму();	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыНаФорму()
	
	Если Элементы.Найти("РазделитьЗаказПоставщика") = Неопределено Тогда
	
	    НоваяКоманда = ЭтаФорма.Команды.Добавить("РазделитьЗаказПоставщика");
	    НоваяКоманда.Действие = "ВыполнитьКоманду_Разделить";
		НоваяКоманда.Заголовок = "Разделить заказ поставщику";
	    НоваяКнопка = ЭтаФорма.Элементы.Вставить("КнопкаВНачале", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ФормаКоманднаяПанель);
	    НоваяКнопка.ИмяКоманды = "РазделитьЗаказПоставщика";
		Элементы.Переместить(НоваяКнопка, ЭтаФорма.Элементы.КоманднаяПанель, ЭтаФорма.Элементы.ФормаСоздатьПоШаблону);
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду_Разделить(Команда)

	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран заказ поставщика!";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	ЗаказПоставщикуСсылка = ТекущаяСтрока.Ссылка;
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ЗаказПоставщику", ЗаказПоставщикуСсылка);
	
	ОткрытьФорму("Обработка.СЗПР_РазделениеЗаказовПоставщику.Форма.Форма", ПараметрыОбработки,,,,,,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры
